## Introduction
<p><img src="https://hope1032.com.au/wp-content/uploads/2019/04/Lego-Movie-2-3-2.jpg" alt="A picture of Lego characters!" ></p>
<h3 id="letslookatlegosets">Let's look at Lego sets!</h3>
<p>Lego is a household name across the world, supported by a diverse toy line, hit movies, and a series of successful video games. In this project, we are going to explore a key development in the history of Lego: the introduction of licensed sets such as Star Wars, Super Heroes, and Harry Potter.</p>
<p>It may not be widely known, but Lego has had its share of ups and downs since its inception in the early 20th century. This includes a particularly rough period in the late 90s. As described in <a href="https://www.businessinsider.com/how-lego-made-a-huge-turnaround-2014-2?r=US&IR=T">this article</a>, Lego was only able to survive due to a successful internal brand (Bionicle) and the introduction of its first licensed series: Star Wars. In the instructions panel are the two questions you will need to answer to complete this project.</p>
<p>Before diving into our analysis though, let's become familiar with the two datasets that will help you with this project:<br><br></p>
<div style="background-color: #ebf4f7; color: #595959; text-align:left; vertical-align: middle; padding: 15px 25px 15px 25px; line-height: 1.6;">
    <div style="font-size:20px"><b>datasets/lego_sets.csv</b></div>
<ul>
    <li><b>set_num:</b> A code that is unique to each set in the dataset. <b><i>This column is critical, and a missing value indicates the set is a duplicate or invalid!</i></b></li>
    <li><b>set_name:</b> A name for every set in the dataset (note that this can be the same for different sets).</li>
    <li><b>year:</b> The date the set was released.</li>
    <li><b>num_parts:</b> The number of parts contained in the set.<b><i> This column is not central to our analyses, so missing values are acceptable.</i></b></li>
        <li><b>theme_name:</b> The name of the sub-theme of the set.</li>
    <li><b>parent_theme:</b> The name of the parent theme the set belongs to. Matches the `name` column of the `parent_themes` csv file.</li>
</ul>

<div style="font-size:20px"><b>datasets/parent_themes.csv</b></div>
<ul>
    <li><b>id:</b> A code that is unique to every theme.</li>
    <li><b>name:</b> The name of the parent theme.</li>
    <li><b>is_licensed:</b> A Boolean column specifying whether the theme is a licensed theme.</li>
</ul>
    </div>
<p>From here on out, it will be our task to explore and manipulate the existing data until we are able to answer the two questions described in the instructions panel. Feel free to add as many cells as necessary.</p>

<h3>Project Tasks</h3>
<p>The Project Task is Based on solving the Business Questions By Using Pandas as a Tools. The Questions Are Below :</p>
<h5>Q1.What percentage of all licensed sets ever released were Star Wars Themed?</h5>
<h5>Q2.In Which year was Star Wars not the most popular licensed Terms(in terms of number of sets released the year)?</h5>

<h5>Importing the Libraries & Data</h5>

In [28]:
import pandas as pd
import numpy as np

df = pd.read_csv('https://raw.githubusercontent.com/mrblink2002/Lego_Data_Analytics/main/datasets/lego_sets.csv')
parent_theme = pd.read_csv('https://raw.githubusercontent.com/mrblink2002/Lego_Data_Analytics/main/datasets/parent_themes.csv')

<h5>Examing The Lego Set</h5>

In [3]:
df.head()

,set_num,name,year,num_parts,theme_name,parent_theme
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space

<h5>Examing & Exploring the Dataset's</h5>

In [4]:
parent_theme.head()

    id     name  is_licensed
0    1  Technic        False
1   22  Creator        False
2   50     Town        False
3  112   Racers        False
4  126    Space        False

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11986 entries, 0 to 11985
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   set_num       11833 non-null  object
 1   name          11833 non-null  object
 2   year          11986 non-null  int64
 3   num_parts     6926 non-null   float64
 4   theme_name    11833 non-null  object
 5   parent_theme  11986 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 562.0+ KB

In [6]:
parent_theme.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111 entries, 0 to 110
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           111 non-null    int64
 1   name         111 non-null    object
 2   is_licensed  111 non-null    bool
dtypes: bool(1), int64(1), object(1)
memory usage: 2.0+ KB

In [27]:
df.describe()

               year    num_parts
count  11833.000000  6835.000000
mean    2002.172568   162.149086
std       13.495910   332.799982
min     1950.000000    -1.000000
25%     1997.000000    10.000000
50%     2006.000000    45.000000
75%     2013.000000   170.000000
max     2017.000000  5922.000000

In [8]:
df.dtypes

set_num          object
name             object
year              int64
num_parts       float64
theme_name       object
parent_theme     object
dtype: object

In [9]:
df.head()

,set_num,name,year,num_parts,theme_name,parent_theme
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space

In [10]:
df.dtypes

set_num          object
name             object
year              int64
num_parts       float64
theme_name       object
parent_theme     object
dtype: object

<h5>Inspecting the Unique Values</h5>

In [11]:
df.set_num.unique()

array(['00-1', '0011-2', '0011-3', ..., 'WishingWell-1', 'wwgp1-1', nan],
      dtype=object)

In [12]:
df["set_num"].value_counts()

00-1       1
720-1      1
7191-1     1
7194-1     1
7195-1     1
          ..
4267-1     1
427-1      1
4271-1     1
4274-1     1
wwgp1-1    1
Name: set_num, Length: 11833, dtype: int64

<h5>Examing the Missing Values</h5>

In [13]:
df["set_num"].isna().sum()

153

<h5>Handling Missing Values</h5>

In [14]:
df.dropna(inplace=True, axis = "index",how='any',subset=['set_num'])

In [15]:
df.set_num.isna().sum()

0

<h5>Making Three Different Columns For Different Values</h5>

In [29]:
df[["Set","Number","Sub-Number"]] = df['set_num'].str.split('-',expand=True)

In [17]:
df.head()

,set_num,name,year,num_parts,theme_name,parent_theme,Set,Number,Sub-Number
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland,00,1,None
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town,0011,2,None
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle,0011,3,None
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space,0012,1,None
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space,0013,1,None

<h5>Renaming the Columns To Maintain Consistency</h5>

In [30]:
df.columns = [x.lower().replace('-','') for x in df.columns]

In [19]:
df.head()

,set_num,name,year,num_parts,theme_name,parent_theme,set,number,subnumber
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland,00,1,None
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town,0011,2,None
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle,0011,3,None
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space,0012,1,None
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space,0013,1,None

<h5>Merging The Two Tables</h5>

In [31]:
merged_data = df.merge(parent_theme, how = 'inner', left_on = 'parent_theme', right_on = 'name',suffixes = ('_Left','_Right'))
merged_data.head()

,set_num,name_Left,year,num_parts,theme_name,parent_theme,set,number,subnumber,id,name_Right,is_licensed
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland,00,1,None,411,Legoland,False
1,00-2,Weetabix Promotional House 1,1976,NaN,Building,Legoland,00,2,None,411,Legoland,False
2,00-3,Weetabix Promotional House 2,1976,NaN,Building,Legoland,00,3,None,411,Legoland,False
3,00-4,Weetabix Promotional Windmill,1976,126.0,Building,Legoland,00,4,None,411,Legoland,False
4,00-7,Weetabix Promotional Lego Village,1976,NaN,Building,Legoland,00,7,None,411,Legoland,False

<h5>Now Answering The Question No 1</h5>

In [32]:
#Filtering Only Licensed
licensed = merged_data[merged_data['is_licensed'] == True]
licensed.head()

,set_num,name_Left,year,num_parts,theme_name,parent_theme,set,number,subnumber,id,name_Right,is_licensed
3493,10018-1,Darth Maul,2001,1868.0,Star Wars,Star Wars,10018,1,None,158,Star Wars,True
3494,10019-1,Rebel Blockade Runner - UCS,2001,NaN,Star Wars Episode 4/5/6,Star Wars,10019,1,None,158,Star Wars,True
3495,10026-1,Naboo Starfighter - UCS,2002,NaN,Star Wars Episode 1,Star Wars,10026,1,None,158,Star Wars,True
3496,10030-1,Imperial Star Destroyer - UCS,2002,3115.0,Star Wars Episode 4/5/6,Star Wars,10030,1,None,158,Star Wars,True
3497,10123-1,Cloud City,2003,707.0,Star Wars Episode 4/5/6,Star Wars,10123,1,None,158,Star Wars,True

In [33]:
star_wars = licensed[licensed["name_Right"] == "Star Wars"] 
star_wars.head()

,set_num,name_Left,year,num_parts,theme_name,parent_theme,set,number,subnumber,id,name_Right,is_licensed
3493,10018-1,Darth Maul,2001,1868.0,Star Wars,Star Wars,10018,1,None,158,Star Wars,True
3494,10019-1,Rebel Blockade Runner - UCS,2001,NaN,Star Wars Episode 4/5/6,Star Wars,10019,1,None,158,Star Wars,True
3495,10026-1,Naboo Starfighter - UCS,2002,NaN,Star Wars Episode 1,Star Wars,10026,1,None,158,Star Wars,True
3496,10030-1,Imperial Star Destroyer - UCS,2002,3115.0,Star Wars Episode 4/5/6,Star Wars,10030,1,None,158,Star Wars,True
3497,10123-1,Cloud City,2003,707.0,Star Wars Episode 4/5/6,Star Wars,10123,1,None,158,Star Wars,True

In [39]:
(star_wars.shape[0] / licensed.shape[0]) * 100

45.72072072072072

<h5>About 45% of Licensed Sets ever released were Star Wars Themed</h5>

<h5>Now Answering the Question No 2</h5>

In [46]:
grouped = star_wars.groupby(by = "year")

count = grouped.count()['set_num']

print(count)

year
1999    13
2000    26
2001    14
2002    28
2003    32
2004    20
2005    28
2006    11
2007    16
2008    23
2009    39
2010    30
2011    32
2012    43
2013    35
2014    45
2015    58
2016    61
2017    55
Name: set_num, dtype: int64

In [47]:
count.nsmallest(n=1)

year
2006    11
Name: set_num, dtype: int64

In [67]:
merged_data.head()

,set_num,name_Left,year,num_parts,theme_name,parent_theme,set,number,subnumber,id,name_Right,is_licensed
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland,00,1,None,411,Legoland,False
1,00-2,Weetabix Promotional House 1,1976,NaN,Building,Legoland,00,2,None,411,Legoland,False
2,00-3,Weetabix Promotional House 2,1976,NaN,Building,Legoland,00,3,None,411,Legoland,False
3,00-4,Weetabix Promotional Windmill,1976,126.0,Building,Legoland,00,4,None,411,Legoland,False
4,00-7,Weetabix Promotional Lego Village,1976,NaN,Building,Legoland,00,7,None,411,Legoland,False

In [70]:
merged_subset = merged_data[['set_num','year','num_parts','parent_theme','is_licensed']]
merged_subset.head()

  set_num  year  num_parts parent_theme  is_licensed
0    00-1  1970      471.0     Legoland        False
1    00-2  1976        NaN     Legoland        False
2    00-3  1976        NaN     Legoland        False
3    00-4  1976      126.0     Legoland        False
4    00-7  1976        NaN     Legoland        False

In [71]:
licensed_subset = merged_subset[merged_subset["is_licensed"]]

In [72]:
licensed_subset

       set_num  year  num_parts parent_theme  is_licensed
3493   10018-1  2001     1868.0    Star Wars         True
3494   10019-1  2001        NaN    Star Wars         True
3495   10026-1  2002        NaN    Star Wars         True
3496   10030-1  2002     3115.0    Star Wars         True
3497   10123-1  2003      707.0    Star Wars         True
...        ...   ...        ...          ...          ...
11981   8410-1  2010       22.0       Ben 10         True
11982   8411-1  2010       21.0       Ben 10         True
11983   8517-1  2010       14.0       Ben 10         True
11984   8518-1  2010        NaN       Ben 10         True
11985   8519-1  2010       20.0       Ben 10         True

[1332 rows x 5 columns]

In [73]:
sorted_licensed = licensed_subset.sort_values(by = 'year')

In [74]:
sorted_licensed["count"] = 1

In [75]:
sorted_licensed.head()

     set_num  year  num_parts parent_theme  is_licensed  count
3696  7150-1  1999        NaN    Star Wars         True      1
3702  7161-1  1999      379.0    Star Wars         True      1
3691  7141-1  1999      179.0    Star Wars         True      1
3705  7171-1  1999        NaN    Star Wars         True      1
3671  7101-1  1999        NaN    Star Wars         True      1

In [91]:
max_df = sorted_licensed.groupby(by = ['year','parent_theme']).sum().reset_index()

In [93]:
max_df = max_df.sort_values('count', ascending = False).drop_duplicates(['year'])

In [101]:
max_df.sort_values(by = 'year',inplace = True)

In [102]:
max_df

    year  parent_theme  num_parts  is_licensed  count
0   1999     Star Wars     1384.0           13     13
2   2000     Star Wars     2580.0           26     26
3   2001  Harry Potter     1582.0           14     14
6   2002     Star Wars     4735.0           28     28
9   2003     Star Wars     6660.0           32     32
11  2004  Harry Potter     2643.0           21     21
16  2005     Star Wars     4730.0           28     28
20  2006     Star Wars     2769.0           11     11
24  2007     Star Wars    11361.0           16     16
28  2008     Star Wars     6865.0           23     23
32  2009     Star Wars     3953.0           39     39
36  2010     Star Wars     6003.0           30     30
42  2011     Star Wars     3451.0           32     32
47  2012     Star Wars     6769.0           43     43
52  2013     Star Wars     6159.0           35     35
59  2014     Star Wars     8293.0           45     45
67  2015     Star Wars    11410.0           58     58
76  2016     Star Wars     6934.0           61     61
82  2017  Super Heroes    18443.0          103    103

<h5>The Year 2017 is the Year Where Star Wars Was Not Popular</h5>

<h5>Bonus Question</h5>
<h5>How Many Sets Are Released According To Year</h5>

In [104]:
licensed_subset['count'] = 1

C:\Users\Blink\AppData\Local\Temp/ipykernel_9120/2059080911.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  licensed_subset['count'] = 1

In [106]:
grouped_year = licensed_subset.groupby('year')

In [108]:
grouped_year.agg('count')['set_num']

year
1999     13
2000     31
2001     25
2002     50
2003     40
2004     40
2005     35
2006     24
2007     21
2008     43
2009     48
2010     63
2011     81
2012    109
2013     86
2014     99
2015    107
2016    121
2017    143
Name: set_num, dtype: int64

<h5>Above is The Number of Sets Released By Year